

&НаКлиенте
Процедура Загрузить(Команда)
	АдресВВХ = ЗагрузитьНаСервере();
	ЭтаФорма.Закрыть(АдресВВХ);	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьНаСервере()
	
	ТЗ = ПолучитьТЗИзМакета(ТабличныйДокумент);
	  
	  АдресВВХ = ПоместитьВоВременноеХранилище(ТЗ);
	  
	  Возврат АдресВВХ;
	
КонецФункции

&НаСервере
Функция ПолучитьТЗИзМакета(ТабДок, КолонкаИндекса = 1) Экспорт
    
    ТаблицаДанных = Новый ТаблицаЗначений;
    НомерКолонки = 0;
    Пока Истина Цикл
        НомерКолонки = НомерКолонки + 1;
        ИмяКолонки = ТабДок.Область(1, НомерКолонки).Текст;
        Если ПустаяСтрока(ИмяКолонки) Тогда
            Прервать;
        КонецЕсли;        
        ТаблицаДанных.Колонки.Добавить(ИмяКолонки);
    КонецЦикла;
    
    СчетчикКолонок = НомерКолонки - 1;
    
    НомерСтроки = 1; ФлагПрерывания = Ложь;
    Пока Истина Цикл
        НомерСтроки = НомерСтроки + 1;
        Стр = ТаблицаДанных.Добавить();
        
        Для А = 1 ПО СчетчикКолонок Цикл
            ТекстКолонки = ТабДок.Область(НомерСтроки, А).Текст;
            Если ПустаяСтрока(ТекстКолонки) Тогда
                Если А = КолонкаИндекса Тогда
                    Флагпрерывания = Истина;
                    ТаблицаДанных.Удалить(Стр);
                КонецЕсли;
            Иначе
                Стр[А - 1] = ТекстКолонки
            КонецЕсли;
            
            Если Флагпрерывания Тогда
                Прервать
            КонецЕсли;
        КонецЦикла;
        
        Если Флагпрерывания Тогда
            Прервать
        КонецЕсли;
    КонецЦикла;
    
    Возврат ТаблицаДанных
КонецФункции
