

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СКД = ПолучитьНастройки();
	НастройкиПоУмолчанию = СКД.НастройкиПоУмолчанию;
	АдресВХ = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВХ);
	
	ОтборПоРеквизитам.Инициализировать(ИсточникНастроек);
	ОтборПоРеквизитам.ЗагрузитьНастройки(НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройки()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СКД  =  ОбработкаОбъект.ПолучитьНастройки();            
	Возврат СКД;
	
КонецФункции
